# pandas Series와 DataFrame

## pandas
**pandas** 는 Python 개발자를 위한 데이터 구조, 데이터 분석 도구를 제공하는 오픈소스 라이브러리입니다.

In [2]:
import pandas as pd

## Series
pandas의 **Series** 는 Python의 리스트와 같은 1차원 배열입니다.

In [3]:
airports = pd.Series([
                      'Seattle-Tacoma', 
                      'Dulles', 
                      'London Heathrow', 
                      'Schiphol', 
                      'Changi', 
                      'Pearson', 
                      'Narita'
                      ])

# notebook을 이용할 때 print문을 사용할 수 있습니다.
# print(airports)을 이용하여 변수의 내용을 확인하거나
# 개체 이름을 입력하여 화면에 값을 출력할 수 있습니다.
airports

0     Seattle-Tacoma
1             Dulles
2    London Heathrow
3           Schiphol
4             Changi
5            Pearson
6             Narita
dtype: object

Series의 각 인덱스를 참고하여 개별 값들을 참조할 수 있습니다.

In [4]:
airports[2]

'London Heathrow'

Series의 모든 값을 순회하기 위해 반복문을 이용할 수 있습니다.

In [5]:
for value in airports:
    print(value)

Seattle-Tacoma
Dulles
London Heathrow
Schiphol
Changi
Pearson
Narita

## DataFrame
pandas로 작업할 때 대부분은 2차원 배열을 다룹니다.

pandas **DataFrame** 은 2차원 배열을 저장할 수 있습니다.

In [6]:
airports = pd.DataFrame([
                        ['Seatte-Tacoma', 'Seattle', 'USA'],
                        ['Dulles', 'Washington', 'USA'],
                        ['London Heathrow', 'London', 'United Kingdom'],
                        ['Schiphol', 'Amsterdam', 'Netherlands'],
                        ['Changi', 'Singapore', 'Singapore'],
                        ['Pearson', 'Toronto', 'Canada'],
                        ['Narita', 'Tokyo', 'Japan']
                        ])

airports

                 0           1               2
0    Seatte-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands
4           Changi   Singapore       Singapore
5          Pearson     Toronto          Canada
6           Narita       Tokyo           Japan

DataFrame을 생성할 때 columns의 이름을 지정하기 위해서는 **columns** 인자를 이용하세요.

In [7]:
airports = pd.DataFrame([
                        ['Seatte-Tacoma', 'Seattle', 'USA'],
                        ['Dulles', 'Washington', 'USA'],
                        ['London Heathrow', 'London', 'United Kingdom'],
                        ['Schiphol', 'Amsterdam', 'Netherlands'],
                        ['Changi', 'Singapore', 'Singapore'],
                        ['Pearson', 'Toronto', 'Canada'],
                        ['Narita', 'Tokyo', 'Japan']
                        ],
                        columns = ['Name', 'City', 'Country']
                        )

airports

              Name        City         Country
0    Seatte-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands
4           Changi   Singapore       Singapore
5          Pearson     Toronto          Canada
6           Narita       Tokyo           Japan